app/controllers/pins_controller.rb

	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save
---
INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Pin test"], ["description", "asdasdasdas"], ["user_id", 1], ["created_at", "2015-12-16 10:14:13.093998"], ["updated_at", "2015-12-16 10:14:13.093998"]]

	def update
		if @pin.update(pin_params)
---
UPDATE "pins" SET "title" = ?, "description" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = ?